test/fixtures/checkouts/exuw7apwoycchjuwtiqg8nytfhphr62a/complete.json

{
  "checkout": {
    "clone_url": "https://checkout.local/690933842/checkouts/b490a9220cd14d7344024f4874f640a6/clone",
    "completed_at": null,
    "created_at": "2012-10-12T07:05:27-04:00",
    "currency": "USD",
    "presentment_currency": "USD",
    "customer_id": 207119551,
    "customer_locale": null,
    "device_id": null,
    "discount_code": null,
    "email": "bob.norman@hostmail.com",
    "legal_notice_url": null,
    "location_id": null,
    "name": "#86568385",
    "note": "",
    "note_attributes": {
      "custom engraving": "Happy Birthday",
      "colour": "green"
    },
    "order_id": null,
    "order_status_url": null,
    "order": null,
    "payment_due": "0.00",
    "payment_url": "https://app.local/cardserver/sessions",
    "payments": [],
    "phone": null,
    "shopify_payments_account_id": null,
    "privacy_policy_url": null,
    "refund_policy_url": null,
    "requires_shipping": false,
    "reservation_time_left": 0,
    "reservation_time": null,
    "source_identifier": null,
    "source_name": "web",
    "source_url": null,
    "subtotal_price": "0.00",
    "shipping_policy_url": null,
    "tax_exempt": false,
    "taxes_included": false,
    "terms_of_service_url": null,
    "token": "b490a9220cd14d7344024f4874f640a6",
    "total_price": "0.00",
    "total_tax": "0.00",
    "total_line_items_price": "0.00",
    "updated_at": "2018-09-25T15:30:38-04:00",
    "user_id": null,
    "web_url": "https://checkout.local/690933842/checkouts/b490a9220cd14d7344024f4874f640a6",
    "line_items": [
      {
        "id": 49148385,
        "key": 49148385,
        "product_id": 632910392,
        "variant_id": 49148385,
        "sku": "IPOD2008RED",
        "vendor": "Apple",
        "title": "IPod Nano - 8GB",
        "variant_title": "Red",
        "image_url": "https://cdn.shopify.com/s/files/1/0006/9093/3842/products/ipod-nano.png?v=1537902937",
        "taxable": true,
        "requires_shipping": false,
        "gift_card": false,
        "price": "0.00",
        "compare_at_price": null,
        "line_price": "0.00",
        "properties": {},
        "quantity": 1,
        "grams": 200,
        "fulfillment_service": "manual",
        "applied_discounts": []
      }
    ],
    "gift_cards": [],
    "tax_lines": [],
    "tax_manipulations": [],
    "shipping_line": null,
    "shipping_rate": null,
    "shipping_address": {
      "id": 550558813,
      "first_name": "Bob",
      "last_name": "Norman",
      "phone": "555-625-1199",
      "company": null,
      "address1": "Chestnut Street 92",
      "address2": "",
      "city": "Louisville",
      "province": "Kentucky",
      "province_code": "KY",
      "country": "United States",
      "country_code": "US",
      "zip": "40202"
    },
    "credit_card": null,
    "billing_address": {
      "id": 550558813,
      "first_name": "Bob",
      "last_name": "Norman",
      "phone": "555-625-1199",
      "company": null,
      "address1": "Chestnut Street 92",
      "address2": "",
      "city": "Louisville",
      "province": "Kentucky",
      "province_code": "KY",
      "country": "United States",
      "country_code": "US",
      "zip": "40202"
    },
    "applied_discount": null
  }
}
